In [1]:
import pandas as pd

In [10]:
# Load data
file = "archive/top100_unique4.csv"
compose = "archive/top100_uniq_composers.csv"
direct = "archive/top100_uniq_directors.csv"
genre = "archive/genre_unique.csv"

# Read data
actors_df = pd.read_csv(file)
composers_df = pd.read_csv(compose)
directors_df = pd.read_csv(direct)
genre_df = pd.read_csv(genre)

# test
# actors_df.head(5)
# composers_df.head(5)
# directors_df.head(5)
genre_df.head(5)

   genre_id     name
0        28   Action
1      9648  Mystery
2        37  Western
3        18    Drama
4     10749  Romance

## Reorder alphabetically

In [5]:
# Actors
top100_actors = actors_df.sort_values('name')
top100_actors.head()

    cast_id                   name
37    97015            Adam Driver
32     1553           Adam Sandler
81      263        Anthony Hopkins
89     3478  Arnold Schwarzenegger
97     2636            Ben Affleck

In [11]:
# Composers
top100_composers = composers_df.sort_values('name')
top100_composers.head()

    crew_id               name
64    34424       Aaron Zigman
17     1163        Alan Menken
3       123     Alan Silvestri
60    28923  Alexandre Desplat
78    56971  Andrew Lockington

In [13]:
# Directors
top100_directors = directors_df.sort_values('name')
top100_directors.head()

    crew_id            name
64    18948   Adam Shankman
27     2576  Andrew Adamson
2         2  Andrew Stanton
78    37279   Anthony Russo
60    15821   Antoine Fuqua

In [16]:
# Genres
alph_genres = genre_df.sort_values('name')
alph_genres.head()

    genre_id       name
0         28     Action
11        12  Adventure
7         16  Animation
9         35     Comedy
6         80      Crime

## Export as CSV

In [6]:
# Actors
top100_actors.to_csv('archive/top100_actors.csv')

In [12]:
# Composers
top100_composers.to_csv('archive/top100_composers.csv')

In [14]:
# Directors
top100_directors.to_csv('archive/top100_directors.csv')

In [17]:
# Genre
alph_genres.to_csv('archive/alph_genres.csv')